src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ПоступлениеДополнительныхРасходов/ПоступлениеДополнительныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеДополнительныхРасходов</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПартии</name>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТовара</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/УценкаТоваров/УценкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УценкаТоваров</name>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаНовая</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ManagerModule.bsl
#Область Формирование_движений
 
Процедура РаспределитьНаСебестоимость(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеДополнительныхРасходов") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧТовары.Номенклатура КАК Номенклатура,
		                      |	ТЧТовары.Характеристика КАК Характеристика,
		                      |	ТЧТовары.Серия КАК Серия,
		                      |	ТЧТовары.ДокументПартии КАК Партия,
		                      |	ТЧТовары.СтатьяДДС КАК СтатьяДДС,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА ТЧТовары.Ссылка.ЦенаВключаетНДС
		                      |				ТОГДА ТЧТовары.Сумма
		                      |			ИНАЧЕ ТЧТовары.Сумма + ТЧТовары.СуммаНДС
		                      |		КОНЕЦ) КАК Сумма,
		                      |	СУММА(ТЧТовары.СуммаНДС) КАК СуммаНДС
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.ПоступлениеДополнительныхРасходов.ТЧТовары КАК ТЧТовары
		                      |ГДЕ
		                      |	ТЧТовары.Ссылка = &Док
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ТЧТовары.Номенклатура,
		                      |	ТЧТовары.Характеристика,
		                      |	ТЧТовары.Серия,
		                      |	ТЧТовары.ДокументПартии,
		                      |	ТЧТовары.СтатьяДДС
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТоварыВНаличии.МестоХранения КАК МестоХранения,
		                      |	ТоварыВНаличии.Номенклатура КАК Номенклатура,
		                      |	ТоварыВНаличии.Характеристика КАК Характеристика,
		                      |	ТоварыВНаличии.Серия КАК Серия,
		                      |	ТоварыВНаличии.Партия КАК Партия,
		                      |	ТоварыВНаличии.Количество КАК Количество,
		                      |	ТоварыВНаличии.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
		                      |ГДЕ
		                      |	ТоварыВНаличии.Регистратор В
		                      |			(ВЫБРАТЬ
		                      |				ВТ.Партия
		                      |			ИЗ
		                      |				ВТ)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	ВТ.Характеристика КАК Характеристика,
		                      |	ВТ.Серия КАК Серия,
		                      |	ВТ.Партия КАК Партия,
		                      |	ВТ.СтатьяДДС КАК СтатьяДДС,
		                      |	ВТ.Сумма КАК Сумма,
		                      |	ВТ.СуммаНДС КАК СуммаНДС
		                      |ИЗ
		                      |	ВТ КАК ВТ");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Рез = Запрос.ВыполнитьПакет();
		ТЗТовары = Рез[1].Выгрузить();
		ТЗДополнительныеРасходы = Рез[2].Выгрузить();
		РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЗДополнительныеРасходы);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.УценкаТоваров") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧТовары.Номенклатура КАК Номенклатура,
		                      |	ТЧТовары.Характеристика КАК Характеристика,
		                      |	ТЧТовары.Серия КАК Серия,
		                      |	ТЧТовары.ЦенаНовая КАК Цена,
		                      |	ТЧТовары.Ссылка.МестоХранения КАК МестоХранения,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.УценкаТоваров) КАК СтатьяДДС
		                      |ПОМЕСТИТЬ ВТ
		                      |ИЗ
		                      |	Документ.УценкаТоваров.ТЧТовары КАК ТЧТовары
		                      |ГДЕ
		                      |	ТЧТовары.Ссылка = &Док
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ТЧТовары.Номенклатура,
		                      |	ТЧТовары.Характеристика,
		                      |	ТЧТовары.ЦенаНовая,
		                      |	ТЧТовары.Серия,
		                      |	ТЧТовары.Ссылка.МестоХранения
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТоварыВНаличииОстатки.МестоХранения КАК МестоХранения,
		                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
		                      |	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
		                      |	ТоварыВНаличииОстатки.Серия КАК Серия,
		                      |	ТоварыВНаличииОстатки.Партия КАК Партия,
		                      |	ТоварыВНаличииОстатки.КоличествоОстаток КАК Количество,
		                      |	ТоварыВНаличииОстатки.СуммаОстаток КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыВНаличии.Остатки(
		                      |			&Дата,
		                      |			(МестоХранения, Номенклатура, Характеристика, Серия) В
		                      |				(ВЫБРАТЬ
		                      |					ВТ.МестоХранения,
		                      |					ВТ.Номенклатура,
		                      |					ВТ.Характеристика,
		                      |					ВТ.Серия
		                      |				ИЗ
		                      |					ВТ)) КАК ТоварыВНаличииОстатки
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТ.Номенклатура КАК Номенклатура,
		                      |	ВТ.Характеристика КАК Характеристика,
		                      |	ВТ.Серия КАК Серия,
		                      |	ТоварыВНаличииОстатки.КоличествоОстаток * ВТ.Цена - ЕСТЬNULL(ТоварыВНаличииОстатки.СуммаОстаток, 0) - ЕСТЬNULL(ДополнительныеРасходыОстатки.СуммаОстаток, 0) КАК Сумма,
		                      |	ВТ.СтатьяДДС КАК СтатьяДДС
		                      |ИЗ
		                      |	ВТ КАК ВТ
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Остатки(&Дата, ) КАК ТоварыВНаличииОстатки
		                      |		ПО ВТ.Номенклатура = ТоварыВНаличииОстатки.Номенклатура
		                      |			И ВТ.Характеристика = ТоварыВНаличииОстатки.Характеристика
		                      |			И ВТ.Серия = ТоварыВНаличииОстатки.Серия
		                      |			И ВТ.МестоХранения = ТоварыВНаличииОстатки.МестоХранения
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДополнительныеРасходы.Остатки(&Дата, ) КАК ДополнительныеРасходыОстатки
		                      |		ПО ВТ.Номенклатура = ДополнительныеРасходыОстатки.Номенклатура
		                      |			И ВТ.Характеристика = ДополнительныеРасходыОстатки.Характеристика
		                      |			И ВТ.Серия = ДополнительныеРасходыОстатки.Серия
		                      |			И ВТ.МестоХранения = ДополнительныеРасходыОстатки.МестоХранения");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Запрос.УстановитьПараметр("Дата", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ДокОбъект));
		Рез = Запрос.ВыполнитьПакет();
		ТЗТовары = Рез[1].Выгрузить();
		ТЗДополнительныеРасходы = Рез[2].Выгрузить();
		РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЗДополнительныеРасходы);
	Иначе
		ТЗДополнительныеРасходы = ДокОбъект.ТЧДополнительныеРасходы.Выгрузить();
		Если ТЗДополнительныеРасходы.Колонки.Найти("СуммаСНДС") <> Неопределено Тогда 
			ТЗДополнительныеРасходы.Колонки.Удалить("Сумма");
			ТЗДополнительныеРасходы.Колонки.СуммаСНДС.Имя = "Сумма";
		КонецЕсли;
		ТЗТовары = ДокОбъект.Движения.ТоварыВНаличии.Выгрузить(); 
		РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЗДополнительныеРасходы);		
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьПриход(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Партия, СтатьяДДС, Сумма,
		СуммаНДС = 0) Экспорт
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ДополнительныеРасходы.ДобавитьПриход();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика; 
	НС.Серия = Серия;
	НС.Партия = Партия;
	НС.СтатьяДДС = СтатьяДДС;
	НС.Сумма = Сумма;
	НС.СуммаНДС = СуммаНДС;
КонецПроцедуры

Процедура ДобавитьРасход(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Партия, СтатьяДДС, Сумма,
		СуммаНДС = 0, Комплект = Неопределено) Экспорт
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ДополнительныеРасходы.ДобавитьРасход();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика; 
	НС.Серия = Серия;
	НС.Партия = Партия;
	НС.СтатьяДДС = СтатьяДДС;
	НС.Сумма = Сумма;
	НС.СуммаНДС = СуммаНДС;
	Если Комплект <> Неопределено Тогда
		НС.Комплект = Комплект;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

Процедура РаспределитьПоПозициям(ДокОбъект, ТЗТовары, ТЧДополнительныеРасходы) Экспорт 
	ЭтоРеализация = ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг");
	Для Каждого СтрДопРасход Из ТЧДополнительныеРасходы Цикл	
		// Получаем основу распределения
		Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(СтрДопРасход, "Номенклатура") и  ЗначениеЗаполнено(СтрДопРасход.Номенклатура) Тогда
			МасТовары = ТЗТовары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрДопРасход.Номенклатура, СтрДопРасход.Характеристика));
			СуммаТоваров = 0;
			Для Каждого Стр Из МасТовары Цикл
				СуммаТоваров = СуммаТоваров + Стр.Сумма;	
			КонецЦикла;	
		Иначе
			МасТовары = ТЗТовары;
			СуммаТоваров = ТЗТовары.Итог("Сумма");
		КонецЕсли;
		// Распределяем; НДС издержки (если есть в источнике) делится той же пропорцией
		СуммаКРаспределению = СтрДопРасход.Сумма;
		СуммаНДСИздержки = ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(СтрДопРасход, "СуммаНДС"), СтрДопРасход.СуммаНДС, 0);
		СуммаНДСКРаспределению = СуммаНДСИздержки;
		КоличествоТоваров = МасТовары.Количество(); 
		Для А = 1 По КоличествоТоваров Цикл
			Стр = МасТовары[А - 1];
			СуммаНаТовар = ?(А = КоличествоТоваров, СуммаКРаспределению, Окр(СтрДопРасход.Сумма / СуммаТоваров * Стр.Сумма, 2));
			СуммаНДСНаТовар = ?(А = КоличествоТоваров, СуммаНДСКРаспределению,
				РегистрыНакопления.ТоварыВНаличии.ДоляСуммы(СуммаНДСИздержки, Стр.Сумма, СуммаТоваров));
			ДобавитьПриход(ДокОбъект.Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, Стр.Партия, СтрДопРасход.СтатьяДДС, СуммаНаТовар, СуммаНДСНаТовар);
			Если ЭтоРеализация Тогда
				ДобавитьРасход(ДокОбъект.Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, Стр.Партия, СтрДопРасход.СтатьяДДС, СуммаНаТовар, СуммаНДСНаТовар);	
			КонецЕсли;	
			СуммаКРаспределению = СуммаКРаспределению - СуммаНаТовар; 
			СуммаНДСКРаспределению = СуммаНДСКРаспределению - СуммаНДСНаТовар;
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры


#КонецОбласти
